content/posts/Data_analysis_using_regression_and_multilevel_hierarchical_models_by_Andrew_Gelman_and_Jennifer_Hill_in_2006.md
+++
title = "Data analysis using regression and multilevel hierarchical models by Andrew Gelman and Jennifer Hill in 2006"
author = ["Cameron Smith"]
lastmod = 2020-09-20T17:34:14-04:00
slug = "Data_analysis_using_regression_and_multilevel_hierarchical_models_by_Andrew_Gelman_and_Jennifer_Hill_in_2006"
draft = false
+++

## [books]({{< relref "books" >}}), [probabilistic inference]({{< relref "probabilistic_inference" >}}), [Andrew Gelman]({{< relref "Andrew_Gelman" >}}), [Jennifer Hill]({{< relref "Jennifer_Hill" >}}) {#books--books-dot-md--probabilistic-inference--probabilistic-inference-dot-md--andrew-gelman--andrew-gelman-dot-md--jennifer-hill--jennifer-hill-dot-md}


## references {#references}


### <http://www.stat.columbia.edu/~gelman/arm/> {#http-www-dot-stat-dot-columbia-dot-edu-gelman-arm}


### Note that this book is currently undergoing a separation into two books. The book website currently inside a folder named "arm" clearly intends to eventually refer to the second book exclusively on multilevel or hierarchical modeling {#note-that-this-book-is-currently-undergoing-a-separation-into-two-books-dot-the-book-website-currently-inside-a-folder-named-arm-clearly-intends-to-eventually-refer-to-the-second-book-exclusively-on-multilevel-or-hierarchical-modeling}

<!--list-separator-->

-  [Regression and Other Stories by Andrew Gelman, Jennifer Hill, and Aki Vehtari in 2020]({{< relref "Regression_and_Other_Stories_by_Andrew_Gelman,_Jennifer_Hill,_and_Aki_Vehtari_in_2020" >}})

<!--list-separator-->

-  Advanced Regression and Multilevel Models


## examples {#examples}


### Compare to those of [Regression and Other Stories by Andrew Gelman, Jennifer Hill, and Aki Vehtari in 2020]({{< relref "Regression_and_Other_Stories_by_Andrew_Gelman,_Jennifer_Hill,_and_Aki_Vehtari_in_2020" >}}) at least for part 1 of the book {#compare-to-those-of-regression-and-other-stories-by-andrew-gelman-jennifer-hill-and-aki-vehtari-in-2020--regression-and-other-stories-by-andrew-gelman-jennifer-hill-and-aki-vehtari-in-2020-dot-md--at-least-for-part-1-of-the-book}


### <http://www.stat.columbia.edu/~gelman/arm/examples/ARM%5FData.zip> {#http-www-dot-stat-dot-columbia-dot-edu-gelman-arm-examples-arm-data-dot-zip}


### <http://www.stat.columbia.edu/~gelman/arm/examples/> {#http-www-dot-stat-dot-columbia-dot-edu-gelman-arm-examples}


### order of first appearance {#order-of-first-appearance}

<!--list-separator-->

-  Home radon

<!--list-separator-->

-  Forecasting elections

<!--list-separator-->

-  State-level opinions from national polls

<!--list-separator-->

-  Police stops by ethnic group

<!--list-separator-->

-  Public opinion on the death penalty

<!--list-separator-->

-  Testing for election fraud

<!--list-separator-->

-  Sex ratio of births

<!--list-separator-->

-  Mothers’ education and children’s test scores

<!--list-separator-->

-  Height and weight

<!--list-separator-->

-  Beauty and teaching evaluations

<!--list-separator-->

-  Height and earnings

<!--list-separator-->

-  Handedness Yields of mesquite bushes

<!--list-separator-->

-  Political party identification over time

<!--list-separator-->

-  Income and voting

<!--list-separator-->

-  Arsenic in drinking water

<!--list-separator-->

-  Death-sentencing appeals process

<!--list-separator-->

-  Ordered logistic model for storable votes

<!--list-separator-->

-  Cockroaches in apartments

<!--list-separator-->

-  Behavior of couples at risk for HIV

<!--list-separator-->

-  Academy Award voting

<!--list-separator-->

-  Incremental cost-effectiveness ratio

<!--list-separator-->

-  Unemployment time series

<!--list-separator-->

-  The Electric Company TV show

<!--list-separator-->

-  Hypothetical study of parenting quality as an intermediate outcome

<!--list-separator-->

-  Sesame Street TV show

<!--list-separator-->

-  Messy randomized experiment of cow feed

<!--list-separator-->

-  Incumbency and congressional elections

<!--list-separator-->

-  Value of a statistical life

<!--list-separator-->

-  Evaluating the Infant Health and Development Program

<!--list-separator-->

-  Ideology of congress members

<!--list-separator-->

-  Hypothetical randomized-encouragement study

<!--list-separator-->

-  Child support enforcement

<!--list-separator-->

-  Adolescent smoking

<!--list-separator-->

-  Rodents in apartments

<!--list-separator-->

-  Olympic judging

<!--list-separator-->

-  Time series of children’s CD4 counts

<!--list-separator-->

-  Flight simulator experiment

<!--list-separator-->

-  Latin square agricultural experiment

<!--list-separator-->

-  Income and voting by state

<!--list-separator-->

-  Item-response models

<!--list-separator-->

-  Ideal-point modeling for the Supreme Court

<!--list-separator-->

-  Speed dating

<!--list-separator-->

-  Social networks

<!--list-separator-->

-  Regression with censored data

<!--list-separator-->

-  Educational testing experiments

<!--list-separator-->

-  Zinc for HIV-positive children

<!--list-separator-->

-  Cluster sampling of New York City residents

<!--list-separator-->

-  Value added of school teachers

<!--list-separator-->

-  Advanced Placement scores and college grades

<!--list-separator-->

-  Prison sentences

<!--list-separator-->

-  Magnetic fields and brain functioning

<!--list-separator-->

-  Analysis of variance for web connect times

<!--list-separator-->

-  Split-plot latin square

<!--list-separator-->

-  Educational-subsidy program in Mexican villages

<!--list-separator-->

-  Checking models of behavioral learning in dogs

<!--list-separator-->

-  Missing data in the Social Indicators Survey


### alphabetical order {#alphabetical-order}

<!--list-separator-->

-  Academy Award voting

<!--list-separator-->

-  Adolescent smoking

<!--list-separator-->

-  Advanced Placement scores and college grades

<!--list-separator-->

-  Analysis of variance for web connect times

<!--list-separator-->

-  Arsenic in drinking water

<!--list-separator-->

-  Beauty and teaching evaluations

<!--list-separator-->

-  Behavior of couples at risk for HIV

<!--list-separator-->

-  Checking models of behavioral learning in dogs

<!--list-separator-->

-  Child support enforcement

<!--list-separator-->

-  Cluster sampling of New York City residents

<!--list-separator-->

-  Cockroaches in apartments

<!--list-separator-->

-  Death-sentencing appeals process

<!--list-separator-->

-  Educational testing experiments

<!--list-separator-->

-  Educational-subsidy program in Mexican villages

<!--list-separator-->

-  Evaluating the Infant Health and Development Program

<!--list-separator-->

-  Flight simulator experiment

<!--list-separator-->

-  Forecasting elections

<!--list-separator-->

-  Handedness Yields of mesquite bushes

<!--list-separator-->

-  Height and earnings

<!--list-separator-->

-  Height and weight

<!--list-separator-->

-  Home radon

<!--list-separator-->

-  Hypothetical randomized-encouragement study

<!--list-separator-->

-  Hypothetical study of parenting quality as an intermediate outcome

<!--list-separator-->

-  Ideal-point modeling for the Supreme Court

<!--list-separator-->

-  Ideology of congress members

<!--list-separator-->

-  Income and voting

<!--list-separator-->

-  Income and voting by state

<!--list-separator-->

-  Incremental cost-effectiveness ratio

<!--list-separator-->

-  Incumbency and congressional elections

<!--list-separator-->

-  Item-response models

<!--list-separator-->

-  Latin square agricultural experiment

<!--list-separator-->

-  Magnetic fields and brain functioning

<!--list-separator-->

-  Messy randomized experiment of cow feed

<!--list-separator-->

-  Missing data in the Social Indicators Survey

<!--list-separator-->

-  Mothers’ education and children’s test scores

<!--list-separator-->

-  Olympic judging

<!--list-separator-->

-  Ordered logistic model for storable votes

<!--list-separator-->

-  Police stops by ethnic group

<!--list-separator-->

-  Political party identification over time

<!--list-separator-->

-  Prison sentences

<!--list-separator-->

-  Public opinion on the death penalty

<!--list-separator-->

-  Regression with censored data

<!--list-separator-->

-  Rodents in apartments

<!--list-separator-->

-  Sesame Street TV show

<!--list-separator-->

-  Sex ratio of births

<!--list-separator-->

-  Social networks

<!--list-separator-->

-  Speed dating

<!--list-separator-->

-  Split-plot latin square

<!--list-separator-->

-  State-level opinions from national polls

<!--list-separator-->

-  Testing for election fraud

<!--list-separator-->

-  The Electric Company TV show

<!--list-separator-->

-  Time series of children’s CD4 counts

<!--list-separator-->

-  Unemployment time series

<!--list-separator-->

-  Value added of school teachers

<!--list-separator-->

-  Value of a statistical life

<!--list-separator-->

-  Zinc for HIV-positive children


## contents {#contents}


### The content is designed to explain how to fit, graph, and understand classical and multilevel linear and generalized linear models and to use these model fits to make predictions and inferences about quantities of interest, including causal treatment effects {#the-content-is-designed-to-explain-how-to-fit-graph-and-understand-classical-and-multilevel-linear-and-generalized-linear-models-and-to-use-these-model-fits-to-make-predictions-and-inferences-about-quantities-of-interest-including-causal-treatment-effects}


### Chapter 1: Why? {#chapter-1-why}

<!--list-separator-->

-  1.1 What is multilevel regression modeling?

    <!--list-separator-->

    -  Models for regression coefficients

        <!--list-separator-->

        -  Varying-intercept model

        <!--list-separator-->

        -  Varying-intercept, varying slope model

<!--list-separator-->

-


### Chapter 2: Concepts and methods from basic probability and statistics {#chapter-2-concepts-and-methods-from-basic-probability-and-statistics}


### Part 1A: Fit, understand, and graph classical regressions and generalized linear models. {#part-1a-fit-understand-and-graph-classical-regressions-and-generalized-linear-models-dot}

<!--list-separator-->

-  – Chapter 3: Fit linear regressions and be able to interpret and display estimated coefficients.

<!--list-separator-->

-  – Chapter 4: Build linear regression models by transforming and combining variables.

<!--list-separator-->

-  – Chapter 5: Fit, understand, and display logistic regression models for binary data.

<!--list-separator-->

-  – Chapter 6: Fit, understand, and display generalized linear models, including Poisson regression with overdispersion and ordered logit and probit models.


### Part 1B: Use regression to learn about quantities of substantive interest (not just regression coefficients). {#part-1b-use-regression-to-learn-about-quantities-of-substantive-interest--not-just-regression-coefficients--dot}

<!--list-separator-->

-  – Chapter 7: Simulate probability models and uncertainty about inferences and predictions.

<!--list-separator-->

-  – Chapter 8: Check model fits using fake-data simulation and predictive simu\* lation.

<!--list-separator-->

-  – Chapter 9: Understand assumptions underlying causal inference. Set up re\* gressions for causal inference and understand the challenges that arise.

<!--list-separator-->

-  – Chapter 10: Understand the assumptions underlying propensity score match\* ing, instrumental variables, and other techniques to perform causal inference when simple regression is not enough. Be able to use these when appropriate.


### Part 2A: Understand and graph multilevel models. {#part-2a-understand-and-graph-multilevel-models-dot}

<!--list-separator-->

-  – Chapter 11: Understand multilevel data structures and models as generaliza\* tions of classical regression.

<!--list-separator-->

-  – Chapter 12: Understand and graph simple varying-intercept regressions and interpret as partial-pooling estimates.

<!--list-separator-->

-  – Chapter 13: Understand and graph multilevel linear models with varying in\* tercepts and slopes, non-nested structures, and other complications.

<!--list-separator-->

-  – Chapter 14: Understand and graph multilevel logistic models.

<!--list-separator-->

-  – Chapter 15: Understand and graph multilevel overdispersed Poisson, ordered logit and probit, and other generalized linear models.


### Part 2B: Fit multilevel models using the software packages R and Bugs. {#part-2b-fit-multilevel-models-using-the-software-packages-r-and-bugs-dot}

<!--list-separator-->

-  – Chapter 16: Fit varying-intercept regressions and understand the basics of Bugs. Check your programming using fake-data simulation.

<!--list-separator-->

-  – Chapter 17: Use Bugs to fit various models from Part 2A.

<!--list-separator-->

-  – Chapter 18: Understand Bayesian inference as a generalization of least squares and maximum likelihood. Use the Gibbs sampler to fit multilevel models.

<!--list-separator-->

-  – Chapter 19: Use redundant parameterizations to speed the convergence of the Gibbs sampler.


### Part 3: {#part-3}

<!--list-separator-->

-  – Chapter 20: Perform sample size and power calculations for classical and hier\* archical models: standard-error formulas for basic calculations and fake-data simulation for harder problems.

<!--list-separator-->

-  – Chapter 21: Calculate and understand contrasts, explained variance, partial pooling coefficients, and other summaries of fitted multilevel models.

<!--list-separator-->

-  – Chapter 22: Use the ideas of analysis of variance to summarize fitted multilevel models; use multilevel models to perform analysis of variance.

<!--list-separator-->

-  – Chapter 23: Use multilevel models in causal inference.

<!--list-separator-->

-  – Chapter 24: Check the fit of models using predictive simulation.

<!--list-separator-->

-  – Chapter 25: Use regression to impute missing data in multivariate datasets.
